{
  "_class_name": "UNet2DConditionModel",
  "_diffusers_version": "0.21.0",

  "in_channels": 8,
  "out_channels": 8,
  "sample_size": 64,

  "down_block_types": [
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "DownBlock2D"
  ],
  "up_block_types": [
    "UpBlock2D",
    "CrossAttnUpBlock2D",
    "CrossAttnUpBlock2D",
    "CrossAttnUpBlock2D"
  ],

  "block_out_channels": [128, 256, 384, 512],
  "layers_per_block": 2,

  "cross_attention_dim": 1024,
  "attention_head_dim": 8,

  "act_fn": "silu",
  "norm_num_groups": 32,
  "norm_eps": 1e-5,
  "downsample_padding": 1,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "mid_block_scale_factor": 1,
  "only_cross_attention": false,
  "use_linear_projection": false
}
